framework/controllers/UsuariosController.php

    public function actionUpdate($id)
    {
        $model = $this->findModel($id);
        $files = new Attach();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
            Attach::deleteAll(['usuario_id'=>$model->id]);
---
DELETE FROM `attach` WHERE `usuario_id`=3

    protected function findModel($id)
    {
        if (($model = Usuarios::findOne($id)) !== null) {
---
SELECT * FROM `usuarios` WHERE `id`='3'